Revit 2027 API
ExternallyTaggedGeometryValidation Methods
The ExternallyTaggedGeometryValidation type exposes the following members.
Methods
Name | Description
IsNonSolid |  Makes sure that the input geometry object is not a Solid.
IsSolid |  Makes sure that the input geometry object is a Solid.
LacksSubnodes |  Makes sure that the input geometry object does not have sub-nodes.
Top
See Also
Reference
ExternallyTaggedGeometryValidation Class
Autodesk.Revit.DB Namespace